# Transforming Data

Now that we have covered the loading and cleaning of data, we will dive into how we can transform our DataFrames to discover powerful insights and relevant information. We can transform our data based on what type of insights we want to discover and our objectives. 

To start off the lesson we will import the relevant packages, then we will be using the `read.csv()` function to import our data as a DataFrame. For this lesson, we will be importing data of student grades.

In [38]:
import pandas
import numpy

In [43]:
df = pandas.read_csv('Student Grades.csv')

In [44]:
df

,StudentID,FirstName,LastName,GradeAverage,Faculty,Tuition,OfficeHoursParticipated,ClassesSkipped
0,20123456,John,Park,B,Arts,44191,0,5
1,20123457,Alex,Great,B,Science,32245,4,10
2,20123458,Sebastian,Taylor,B,Business,42679,6,7
3,20123459,Michael,Bay,A,Math,46478,15,2
4,20123460,Scott,Foster,A,Engineering,36784,5,8
5,20123461,Amy,Winehouse,B,Arts,36537,10,3
6,20123462,Ralph,Wiggins,B,Business,40762,2,8
7,20123463,Homer,Simpson,C,Engineering,47669,4,7
8,20123464,Marge,Simpson,B,Math,39429,10,3
9,20123465,Peter,Gryffin,D,Arts,31956,7,7
10,20123466,Louise,King,D,Business,33227,6,7
11,20123467,Megan,Botts,A,Science,34751,25,1
12,20123468,Cyrus,Wong,A,Science,49298,20,0
13,20123469,Michelle,Chang,B,Business,35046,5,4
14,20123470,Zachary,Chua,A,Business,31210,10,0
15,20123471,Angus,Helmsworth,B,Business,47515,10,1
16,20123472,Aaron,McDowell,B,Business,43421,13,2
17,20123473,Carol,Kuo,B,Engineering,43063,7,4
18,20123474,Tim,James,B,Science,46775,9,4
19,20123475,Johnson,Curry,B,Engineering,40539,9,3
20,20123476,Paul,Reed,A,Business,41397,14,2
21,20123477,Josh,Hart,A,Engineering,46468,4,8
22,20123478,Justin,Kang,A,Engineering,35859,2,9
23,20123479,Kevin,Yoo,A,Arts,41048,8,1
24,20123480,Rosaline,Jun,A,Arts,44915,25,3
25,20123481,Jimin,Park,B,Engineering,34570,20,3
26,20123482,Joseph,Kim,A,Math,33376,12,6
27,20123483,Chris,Dang,F,Business,44737,3,8
28,20123484,Robbie,Tee,B,Engineering,49682,10,6
29,20123485,Shelly,Yoon,A,Math,33585,5,10

## Selecting Columns and Rows

To select a specific column, simply put the name of the column after the DataFrame in square brackets in quotation. We will see that pandas will output this column as a Series.

In [6]:
df['StudentID']

0     20123456
1     20123457
2     20123458
3     20123459
4     20123460
5     20123461
6     20123462
7     20123463
8     20123464
9     20123465
10    20123466
11    20123467
12    20123468
13    20123469
14    20123470
15    20123471
16    20123472
17    20123473
18    20123474
19    20123475
20    20123476
21    20123477
22    20123478
23    20123479
24    20123480
25    20123481
26    20123482
27    20123483
28    20123484
29    20123485
Name: StudentID, dtype: int64

If there was a scenario where the StudentID along with the grade of the student is to be shown, multiple columns can be shown by submitting a list of columns.

In [8]:
df[['StudentID', 'Faculty']]

    StudentID      Faculty
0    20123456         Arts
1    20123457      Science
2    20123458     Business
3    20123459         Math
4    20123460  Engineering
5    20123461         Arts
6    20123462     Business
7    20123463  Engineering
8    20123464         Math
9    20123465         Arts
10   20123466     Business
11   20123467      Science
12   20123468      Science
13   20123469     Business
14   20123470     Business
15   20123471     Business
16   20123472     Business
17   20123473  Engineering
18   20123474      Science
19   20123475  Engineering
20   20123476     Business
21   20123477  Engineering
22   20123478  Engineering
23   20123479         Arts
24   20123480         Arts
25   20123481  Engineering
26   20123482         Math
27   20123483     Business
28   20123484  Engineering
29   20123485         Math

One simple way of getting the first few rows or the last few rows of the dataset is the use the `head()` and `tail()` function. 

`head()` populates the first 5 rows of the DataFrame, whereas `tail()` populates the last 5 rows.

In [9]:
df

,StudentID,FirstName,LastName,GradeAverage,Faculty,Tuition,OfficeHoursParticipated,ClassesSkipped
0,20123456,John,Park,B,Arts,44191,0,5
1,20123457,Alex,Great,B,Science,32245,4,10
2,20123458,Sebastian,Taylor,B,Business,42679,6,7
3,20123459,Michael,Bay,A,Math,46478,15,2
4,20123460,Scott,Foster,A,Engineering,36784,5,8
5,20123461,Amy,Winehouse,B,Arts,36537,10,3
6,20123462,Ralph,Wiggins,B,Business,40762,2,8
7,20123463,Homer,Simpson,C,Engineering,47669,4,7
8,20123464,Marge,Simpson,B,Math,39429,10,3
9,20123465,Peter,Gryffin,D,Arts,31956,7,7
10,20123466,Louise,King,D,Business,33227,6,7
11,20123467,Megan,Botts,A,Science,34751,25,1
12,20123468,Cyrus,Wong,A,Science,49298,20,0
13,20123469,Michelle,Chang,B,Business,35046,5,4
14,20123470,Zachary,Chua,A,Business,31210,10,0
15,20123471,Angus,Helmsworth,B,Business,47515,10,1
16,20123472,Aaron,McDowell,B,Business,43421,13,2
17,20123473,Carol,Kuo,B,Engineering,43063,7,4
18,20123474,Tim,James,B,Science,46775,9,4
19,20123475,Johnson,Curry,B,Engineering,40539,9,3
20,20123476,Paul,Reed,A,Business,41397,14,2
21,20123477,Josh,Hart,A,Engineering,46468,4,8
22,20123478,Justin,Kang,A,Engineering,35859,2,9
23,20123479,Kevin,Yoo,A,Arts,41048,8,1
24,20123480,Rosaline,Jun,A,Arts,44915,25,3
25,20123481,Jimin,Park,B,Engineering,34570,20,3
26,20123482,Joseph,Kim,A,Math,33376,12,6
27,20123483,Chris,Dang,F,Business,44737,3,8
28,20123484,Robbie,Tee,B,Engineering,49682,10,6
29,20123485,Shelly,Yoon,A,Math,33585,5,10

In [10]:
# First 5 rows
df.head()

,StudentID,FirstName,LastName,GradeAverage,Faculty,Tuition,OfficeHoursParticipated,ClassesSkipped
0,20123456,John,Park,B,Arts,44191,0,5
1,20123457,Alex,Great,B,Science,32245,4,10
2,20123458,Sebastian,Taylor,B,Business,42679,6,7
3,20123459,Michael,Bay,A,Math,46478,15,2
4,20123460,Scott,Foster,A,Engineering,36784,5,8

In [11]:
# Last 5 rows
df.tail()

,StudentID,FirstName,LastName,GradeAverage,Faculty,Tuition,OfficeHoursParticipated,ClassesSkipped
25,20123481,Jimin,Park,B,Engineering,34570,20,3
26,20123482,Joseph,Kim,A,Math,33376,12,6
27,20123483,Chris,Dang,F,Business,44737,3,8
28,20123484,Robbie,Tee,B,Engineering,49682,10,6
29,20123485,Shelly,Yoon,A,Math,33585,5,10

## loc() & iloc()
Another more scalable alternative in selecting columns is the use of `loc()` and `iloc()` functions. 

`loc()` is label-based, which means that we still have to specify the name of the rows and columns by their labels.

`iloc()` is integer-based, which means that you will have to specify the rows and columns by their index.

loc[row_label, column_label]

iloc[row_position, column_position]

Instead of selecting columns/rows you want, these functions will allow you to select columns/rows between or up to a certain column/row name/position.

When using these functions, the `:` symbol means choose all columns/rows in between the left and right of the symbol. If there is no value on either side of the symbol, it means choose all columns/rows.

In [16]:
# Selecting all rows, with only specified columns
df.loc[:,['StudentID', 'GradeAverage']]

    StudentID GradeAverage
0    20123456            B
1    20123457            B
2    20123458            B
3    20123459            A
4    20123460            A
5    20123461            B
6    20123462            B
7    20123463            C
8    20123464            B
9    20123465            D
10   20123466            D
11   20123467            A
12   20123468            A
13   20123469            B
14   20123470            A
15   20123471            B
16   20123472            B
17   20123473            B
18   20123474            B
19   20123475            B
20   20123476            A
21   20123477            A
22   20123478            A
23   20123479            A
24   20123480            A
25   20123481            B
26   20123482            A
27   20123483            F
28   20123484            B
29   20123485            A

In [20]:
# Using iloc function, selecting all rows, with only specified columns
df.iloc[:, [0 , 3]]

    StudentID GradeAverage
0    20123456            B
1    20123457            B
2    20123458            B
3    20123459            A
4    20123460            A
5    20123461            B
6    20123462            B
7    20123463            C
8    20123464            B
9    20123465            D
10   20123466            D
11   20123467            A
12   20123468            A
13   20123469            B
14   20123470            A
15   20123471            B
16   20123472            B
17   20123473            B
18   20123474            B
19   20123475            B
20   20123476            A
21   20123477            A
22   20123478            A
23   20123479            A
24   20123480            A
25   20123481            B
26   20123482            A
27   20123483            F
28   20123484            B
29   20123485            A

In [24]:
# Selecting all rows, with all columns in order from StudentID to Grade
df.loc[:, 'StudentID':'GradeAverage']

    StudentID  FirstName    LastName GradeAverage
0    20123456       John        Park            B
1    20123457       Alex       Great            B
2    20123458  Sebastian      Taylor            B
3    20123459    Michael         Bay            A
4    20123460      Scott      Foster            A
5    20123461        Amy   Winehouse            B
6    20123462      Ralph     Wiggins            B
7    20123463      Homer     Simpson            C
8    20123464      Marge     Simpson            B
9    20123465      Peter     Gryffin            D
10   20123466     Louise        King            D
11   20123467      Megan       Botts            A
12   20123468      Cyrus        Wong            A
13   20123469   Michelle       Chang            B
14   20123470    Zachary        Chua            A
15   20123471      Angus  Helmsworth            B
16   20123472      Aaron    McDowell            B
17   20123473      Carol         Kuo            B
18   20123474        Tim       James            B
19   20123475    Johnson       Curry            B
20   20123476       Paul        Reed            A
21   20123477       Josh        Hart            A
22   20123478     Justin        Kang            A
23   20123479      Kevin         Yoo            A
24   20123480   Rosaline         Jun            A
25   20123481      Jimin        Park            B
26   20123482     Joseph         Kim            A
27   20123483      Chris        Dang            F
28   20123484     Robbie         Tee            B
29   20123485     Shelly        Yoon            A

In [27]:
# Selecting all rows, with columns in order from StudentID to Grade
df.iloc[:, 0:4]

    StudentID  FirstName    LastName GradeAverage
0    20123456       John        Park            B
1    20123457       Alex       Great            B
2    20123458  Sebastian      Taylor            B
3    20123459    Michael         Bay            A
4    20123460      Scott      Foster            A
5    20123461        Amy   Winehouse            B
6    20123462      Ralph     Wiggins            B
7    20123463      Homer     Simpson            C
8    20123464      Marge     Simpson            B
9    20123465      Peter     Gryffin            D
10   20123466     Louise        King            D
11   20123467      Megan       Botts            A
12   20123468      Cyrus        Wong            A
13   20123469   Michelle       Chang            B
14   20123470    Zachary        Chua            A
15   20123471      Angus  Helmsworth            B
16   20123472      Aaron    McDowell            B
17   20123473      Carol         Kuo            B
18   20123474        Tim       James            B
19   20123475    Johnson       Curry            B
20   20123476       Paul        Reed            A
21   20123477       Josh        Hart            A
22   20123478     Justin        Kang            A
23   20123479      Kevin         Yoo            A
24   20123480   Rosaline         Jun            A
25   20123481      Jimin        Park            B
26   20123482     Joseph         Kim            A
27   20123483      Chris        Dang            F
28   20123484     Robbie         Tee            B
29   20123485     Shelly        Yoon            A

We can also use the `loc()` and `iloc()` functions to select rows as well as columns. In `df_grades`, the DataFrame row index is numeric. In this instance, because the index names are a number, we can use a numeric argument in the `loc()` function.

In [45]:
# Selecting rows based on index name, with all columns present
df.loc[[0,3]]

,StudentID,FirstName,LastName,GradeAverage,Faculty,Tuition,OfficeHoursParticipated,ClassesSkipped
0,20123456,John,Park,B,Arts,44191,0,5
3,20123459,Michael,Bay,A,Math,46478,15,2

In [47]:
# Selecting rows based on index, with all columns present
df.iloc[[0,3],:]

,StudentID,FirstName,LastName,GradeAverage,Faculty,Tuition,OfficeHoursParticipated,ClassesSkipped
0,20123456,John,Park,B,Arts,44191,0,5
3,20123459,Michael,Bay,A,Math,46478,15,2

One key note is that when using `loc`, the value after the `:` is included in the result, whereas the `iloc` does not.

In [51]:
# Selecting rows in between based on index name, with all columns present
df.loc[0:3,:]

,StudentID,FirstName,LastName,GradeAverage,Faculty,Tuition,OfficeHoursParticipated,ClassesSkipped
0,20123456,John,Park,B,Arts,44191,0,5
1,20123457,Alex,Great,B,Science,32245,4,10
2,20123458,Sebastian,Taylor,B,Business,42679,6,7
3,20123459,Michael,Bay,A,Math,46478,15,2

In [52]:
# Selecting rows in between based on index, with all columns present
df.iloc[0:3,:]

,StudentID,FirstName,LastName,GradeAverage,Faculty,Tuition,OfficeHoursParticipated,ClassesSkipped
0,20123456,John,Park,B,Arts,44191,0,5
1,20123457,Alex,Great,B,Science,32245,4,10
2,20123458,Sebastian,Taylor,B,Business,42679,6,7

## Conditional Selection

Suppose that we want to filter the data based on specific conditions, such as students who have an outstanding tuition amount of over 40,000 or only students that are in the arts faculty. With conditional statements, we can filter the data to find specific information and insights. 

To write a conditional statement, we will have to write a boolean statement that classifies each value as `True` or `False`, then pandas will then filter for the values that are `True` that match the logic.

In [6]:
# Pandas reads all instances where the row is either True or False, then this logic is inputted to the dataframe condition
import pandas
df = pandas.read_csv('Student Grades.csv')
student_tuition40k = df['Tuition'] >= 40000
student_tuition40k

0      True
1     False
2      True
3      True
4     False
5     False
6      True
7      True
8     False
9     False
10    False
11    False
12     True
13    False
14    False
15     True
16     True
17     True
18     True
19     True
20     True
21     True
22    False
23     True
24     True
25    False
26    False
27     True
28     True
29    False
Name: Tuition, dtype: bool

In [8]:
df[student_tuition40k]

,StudentID,FirstName,LastName,GradeAverage,Faculty,Tuition,OfficeHoursParticipated,ClassesSkipped
0,20123456,John,Park,B,Arts,44191,0,5
2,20123458,Sebastian,Taylor,B,Business,42679,6,7
3,20123459,Michael,Bay,A,Math,46478,15,2
6,20123462,Ralph,Wiggins,B,Business,40762,2,8
7,20123463,Homer,Simpson,C,Engineering,47669,4,7
12,20123468,Cyrus,Wong,A,Science,49298,20,0
15,20123471,Angus,Helmsworth,B,Business,47515,10,1
16,20123472,Aaron,McDowell,B,Business,43421,13,2
17,20123473,Carol,Kuo,B,Engineering,43063,7,4
18,20123474,Tim,James,B,Science,46775,9,4
19,20123475,Johnson,Curry,B,Engineering,40539,9,3
20,20123476,Paul,Reed,A,Business,41397,14,2
21,20123477,Josh,Hart,A,Engineering,46468,4,8
23,20123479,Kevin,Yoo,A,Arts,41048,8,1
24,20123480,Rosaline,Jun,A,Arts,44915,25,3
27,20123483,Chris,Dang,F,Business,44737,3,8
28,20123484,Robbie,Tee,B,Engineering,49682,10,6

In [10]:
# Tuition amount of at least 40k
df[df['Tuition'] >= 40000]

,StudentID,FirstName,LastName,GradeAverage,Faculty,Tuition,OfficeHoursParticipated,ClassesSkipped
0,20123456,John,Park,B,Arts,44191,0,5
2,20123458,Sebastian,Taylor,B,Business,42679,6,7
3,20123459,Michael,Bay,A,Math,46478,15,2
6,20123462,Ralph,Wiggins,B,Business,40762,2,8
7,20123463,Homer,Simpson,C,Engineering,47669,4,7
12,20123468,Cyrus,Wong,A,Science,49298,20,0
15,20123471,Angus,Helmsworth,B,Business,47515,10,1
16,20123472,Aaron,McDowell,B,Business,43421,13,2
17,20123473,Carol,Kuo,B,Engineering,43063,7,4
18,20123474,Tim,James,B,Science,46775,9,4
19,20123475,Johnson,Curry,B,Engineering,40539,9,3
20,20123476,Paul,Reed,A,Business,41397,14,2
21,20123477,Josh,Hart,A,Engineering,46468,4,8
23,20123479,Kevin,Yoo,A,Arts,41048,8,1
24,20123480,Rosaline,Jun,A,Arts,44915,25,3
27,20123483,Chris,Dang,F,Business,44737,3,8
28,20123484,Robbie,Tee,B,Engineering,49682,10,6

Suppose we want information on only one faculty:

In [13]:
# Students that are in the arts faculty
df[df['Faculty'] == 'Art']

,StudentID,FirstName,LastName,GradeAverage,Faculty,Tuition,OfficeHoursParticipated,ClassesSkipped
0,20123456,John,Park,B,Art,44191,0,5
1,20123457,Alex,Great,B,Art,32245,4,10
2,20123458,Sebastian,Taylor,B,Art,42679,6,7
3,20123459,Michael,Bay,A,Art,46478,15,2
4,20123460,Scott,Foster,A,Art,36784,5,8
5,20123461,Amy,Winehouse,B,Art,36537,10,3
6,20123462,Ralph,Wiggins,B,Art,40762,2,8
7,20123463,Homer,Simpson,C,Art,47669,4,7
8,20123464,Marge,Simpson,B,Art,39429,10,3
9,20123465,Peter,Gryffin,D,Art,31956,7,7
10,20123466,Louise,King,D,Art,33227,6,7
11,20123467,Megan,Botts,A,Art,34751,25,1
12,20123468,Cyrus,Wong,A,Art,49298,20,0
13,20123469,Michelle,Chang,B,Art,35046,5,4
14,20123470,Zachary,Chua,A,Art,31210,10,0
15,20123471,Angus,Helmsworth,B,Art,47515,10,1
16,20123472,Aaron,McDowell,B,Art,43421,13,2
17,20123473,Carol,Kuo,B,Art,43063,7,4
18,20123474,Tim,James,B,Art,46775,9,4
19,20123475,Johnson,Curry,B,Art,40539,9,3
20,20123476,Paul,Reed,A,Art,41397,14,2
21,20123477,Josh,Hart,A,Art,46468,4,8
22,20123478,Justin,Kang,A,Art,35859,2,9
23,20123479,Kevin,Yoo,A,Art,41048,8,1
24,20123480,Rosaline,Jun,A,Art,44915,25,3
25,20123481,Jimin,Park,B,Art,34570,20,3
26,20123482,Joseph,Kim,A,Art,33376,12,6
27,20123483,Chris,Dang,F,Art,44737,3,8
28,20123484,Robbie,Tee,B,Art,49682,10,6
29,20123485,Shelly,Yoon,A,Art,33585,5,10

Multiple conditions can be inputted as well. Suppose we want to see student information that skipped at least 3 classes and have participated in 5 or more office hours.

In [18]:
# Students that skipped at least 3 classes and participated in at least 5 hours of office hours
df[(df['ClassesSkipped'] >= 3) & (df['OfficeHoursParticipated'] >= 5)]

,StudentID,FirstName,LastName,GradeAverage,Faculty,Tuition,OfficeHoursParticipated,ClassesSkipped
2,20123458,Sebastian,Taylor,B,Art,42679,6,7
4,20123460,Scott,Foster,A,Art,36784,5,8
5,20123461,Amy,Winehouse,B,Art,36537,10,3
8,20123464,Marge,Simpson,B,Art,39429,10,3
9,20123465,Peter,Gryffin,D,Art,31956,7,7
10,20123466,Louise,King,D,Art,33227,6,7
13,20123469,Michelle,Chang,B,Art,35046,5,4
17,20123473,Carol,Kuo,B,Art,43063,7,4
18,20123474,Tim,James,B,Art,46775,9,4
19,20123475,Johnson,Curry,B,Art,40539,9,3
24,20123480,Rosaline,Jun,A,Art,44915,25,3
25,20123481,Jimin,Park,B,Art,34570,20,3
26,20123482,Joseph,Kim,A,Art,33376,12,6
28,20123484,Robbie,Tee,B,Art,49682,10,6
29,20123485,Shelly,Yoon,A,Art,33585,5,10

## Adding/Removing Columns and Rows

To add new columns to our DataFrame, we can simply declare a new list as a column. Consider a scenario where we want to update our student data with the corresponding cities of the students.

In [55]:
# Keep in mind, the length of the list has to match the length of index of the DataFrame
city = ['Vancouver','Toronto','Calgary','Edmonton','Regina', 'Burnaby', 'Coquitlam', 'London', 'Ottawa', 'Texas',
       'Coquitlam', 'London', 'Ottawa', 'Texas','Edmonton','Regina', 'Burnaby', 'Coquitlam', 'London', 'Ottawa', 
        'Texas', 'Toronto','Calgary','Edmonton','Regina', 'Burnaby', 'Coquitlam', 'London',  'Texas','Edmonton'
       ]

df['City'] = city
df

ValueError: Length of values (30) does not match length of index (22)

Another method of adding new columns is to use the `insert()` function. This function allows us to add the column in any position we like and not only the end. Consider a scenario where now we want to add the age of students in our data, and want to see it before their name.

In [3]:
# Adding a new column in index 1 (2nd column)

df.insert(1, "Age", [21, 23, 24, 21, 25, 18, 22, 25, 28, 34, 
                     22, 23, 25, 21, 25, 26, 24, 23, 29, 31, 
                     28, 24, 24, 23, 22, 20, 23, 25, 26, 42
                    ])
df

,FirstName,Age,LastName,GradeAverage,Faculty,Tuition,OfficeHoursParticipated,ClassesSkipped
StudentID,,,,,,,,
20123456,John,21,Park,B,Arts,44191,0,5
20123457,Alex,23,Great,B,Science,32245,4,10
20123458,Sebastian,24,Taylor,B,Business,42679,6,7
20123459,Michael,21,Bay,A,Math,46478,15,2
20123460,Scott,25,Foster,A,Engineering,36784,5,8
20123461,Amy,18,Winehouse,B,Arts,36537,10,3
20123462,Ralph,22,Wiggins,B,Business,40762,2,8
20123463,Homer,25,Simpson,C,Engineering,47669,4,7
20123464,Marge,28,Simpson,B,Math,39429,10,3
20123465,Peter,34,Gryffin,D,Arts,31956,7,7
20123466,Louise,22,King,D,Business,33227,6,7
20123467,Megan,23,Botts,A,Science,34751,25,1
20123468,Cyrus,25,Wong,A,Science,49298,20,0
20123469,Michelle,21,Chang,B,Business,35046,5,4
20123470,Zachary,25,Chua,A,Business,31210,10,0
20123471,Angus,26,Helmsworth,B,Business,47515,10,1
20123472,Aaron,24,McDowell,B,Business,43421,13,2
20123473,Carol,23,Kuo,B,Engineering,43063,7,4
20123474,Tim,29,James,B,Science,46775,9,4
20123475,Johnson,31,Curry,B,Engineering,40539,9,3
20123476,Paul,28,Reed,A,Business,41397,14,2
20123477,Josh,24,Hart,A,Engineering,46468,4,8
20123478,Justin,24,Kang,A,Engineering,35859,2,9
20123479,Kevin,23,Yoo,A,Arts,41048,8,1
20123480,Rosaline,22,Jun,A,Arts,44915,25,3
20123481,Jimin,20,Park,B,Engineering,34570,20,3
20123482,Joseph,23,Kim,A,Math,33376,12,6
20123483,Chris,25,Dang,F,Business,44737,3,8
20123484,Robbie,26,Tee,B,Engineering,49682,10,6
20123485,Shelly,42,Yoon,A,Math,33585,5,10

While this is uncommon, we can add new rows to the DataFrame as well.

Let's consider a scenario where there is a new student that needs to be submitted to the system. 

To add new rows, we will have to create a new DataFrame with the data we want to add then use the `concat()` function.

In [54]:
new_student = {'StudentID': 20123420, 'Age':21, 'FirstName': 'Scottie', 'LastName': 'Barnes', 'GradeAverage': 'A', 
               'Faculty': 'Science', 'Tuition': 50000,'OfficeHoursParticipated': 0, 'ClassesSkipped': 0, 'City': 'Toronto'}

df2 = pandas.DataFrame(data=new_student, index=[30])

df = pandas.concat([df,df2])
df.tail()

,StudentID,FirstName,LastName,GradeAverage,Faculty,Tuition,OfficeHoursParticipated,ClassesSkipped,Age,City
25,20123481,Jimin,Park,B,Engineering,34570,20,3,NaN,NaN
26,20123482,Joseph,Kim,A,Math,33376,12,6,NaN,NaN
28,20123484,Robbie,Tee,B,Engineering,49682,10,6,NaN,NaN
29,20123485,Shelly,Yoon,A,Math,33585,5,10,NaN,NaN
30,20123420,Scottie,Barnes,A,Science,50000,0,0,21.0,Toronto

To remove columns and rows, we can simply use the `drop()` function. If a student is no longer attending the school or find a categeory to be irrelevant, we can simply remove the data. 

Consider a scenario where the last person to register dropped out of school and their information is to be deleted.

In [39]:
# Drop rows with index number
df = df.drop([30])
df

,StudentID,Age,FirstName,LastName,GradeAverage,Faculty,Tuition,OfficeHoursParticipated,ClassesSkipped,City
0,20123456,21,John,Park,B,Art,44191,0,5,Vancouver
1,20123457,23,Alex,Great,B,Art,32245,4,10,Toronto
2,20123458,24,Sebastian,Taylor,B,Art,42679,6,7,Calgary
3,20123459,21,Michael,Bay,A,Art,46478,15,2,Edmonton
4,20123460,25,Scott,Foster,A,Art,36784,5,8,Regina
5,20123461,18,Amy,Winehouse,B,Art,36537,10,3,Burnaby
6,20123462,22,Ralph,Wiggins,B,Art,40762,2,8,Coquitlam
7,20123463,25,Homer,Simpson,C,Art,47669,4,7,London
8,20123464,28,Marge,Simpson,B,Art,39429,10,3,Ottawa
9,20123465,34,Peter,Gryffin,D,Art,31956,7,7,Texas
10,20123466,22,Louise,King,D,Art,33227,6,7,Coquitlam
11,20123467,23,Megan,Botts,A,Art,34751,25,1,London
12,20123468,25,Cyrus,Wong,A,Art,49298,20,0,Ottawa
13,20123469,21,Michelle,Chang,B,Art,35046,5,4,Texas
14,20123470,25,Zachary,Chua,A,Art,31210,10,0,Edmonton
15,20123471,26,Angus,Helmsworth,B,Art,47515,10,1,Regina
16,20123472,24,Aaron,McDowell,B,Art,43421,13,2,Burnaby
17,20123473,23,Carol,Kuo,B,Art,43063,7,4,Coquitlam
18,20123474,29,Tim,James,B,Art,46775,9,4,London
19,20123475,31,Johnson,Curry,B,Art,40539,9,3,Ottawa
20,20123476,28,Paul,Reed,A,Art,41397,14,2,Texas
21,20123477,24,Josh,Hart,A,Art,46468,4,8,Toronto
22,20123478,24,Justin,Kang,A,Art,35859,2,9,Calgary
23,20123479,23,Kevin,Yoo,A,Art,41048,8,1,Edmonton
24,20123480,22,Rosaline,Jun,A,Art,44915,25,3,Regina
25,20123481,20,Jimin,Park,B,Art,34570,20,3,Burnaby
26,20123482,23,Joseph,Kim,A,Art,33376,12,6,Coquitlam
27,20123483,25,Chris,Dang,F,Art,44737,3,8,London
28,20123484,28,Robbie,Tee,B,Art,49682,10,6,Texas
29,20123485,33,Shelly,Yoon,A,Art,33585,5,10,Edmonton

Anothe way of deleting rows is based on condition. Suppose that all the students in business faculty dropped out.

In [46]:
business_student = df['Faculty'] == 'Business'
business_student

0     False
1     False
2      True
3     False
4     False
5     False
6      True
7     False
8     False
9     False
10     True
11    False
12    False
13     True
14     True
15     True
16     True
17    False
18    False
19    False
20     True
21    False
22    False
23    False
24    False
25    False
26    False
27     True
28    False
29    False
Name: Faculty, dtype: bool

In [47]:
df[business_student]

,StudentID,FirstName,LastName,GradeAverage,Faculty,Tuition,OfficeHoursParticipated,ClassesSkipped
2,20123458,Sebastian,Taylor,B,Business,42679,6,7
6,20123462,Ralph,Wiggins,B,Business,40762,2,8
10,20123466,Louise,King,D,Business,33227,6,7
13,20123469,Michelle,Chang,B,Business,35046,5,4
14,20123470,Zachary,Chua,A,Business,31210,10,0
15,20123471,Angus,Helmsworth,B,Business,47515,10,1
16,20123472,Aaron,McDowell,B,Business,43421,13,2
20,20123476,Paul,Reed,A,Business,41397,14,2
27,20123483,Chris,Dang,F,Business,44737,3,8

In [51]:
df[business_student].index

Int64Index([2, 6, 10, 13, 14, 15, 16, 20, 27], dtype='int64')

In [52]:
# Drop rows based on column value
df = df.drop(df[business_student].index)
df

,StudentID,FirstName,LastName,GradeAverage,Faculty,Tuition,OfficeHoursParticipated,ClassesSkipped
0,20123456,John,Park,B,Arts,44191,0,5
1,20123457,Alex,Great,B,Science,32245,4,10
3,20123459,Michael,Bay,A,Math,46478,15,2
4,20123460,Scott,Foster,A,Engineering,36784,5,8
5,20123461,Amy,Winehouse,B,Arts,36537,10,3
7,20123463,Homer,Simpson,C,Engineering,47669,4,7
8,20123464,Marge,Simpson,B,Math,39429,10,3
9,20123465,Peter,Gryffin,D,Arts,31956,7,7
11,20123467,Megan,Botts,A,Science,34751,25,1
12,20123468,Cyrus,Wong,A,Science,49298,20,0
17,20123473,Carol,Kuo,B,Engineering,43063,7,4
18,20123474,Tim,James,B,Science,46775,9,4
19,20123475,Johnson,Curry,B,Engineering,40539,9,3
21,20123477,Josh,Hart,A,Engineering,46468,4,8
22,20123478,Justin,Kang,A,Engineering,35859,2,9
23,20123479,Kevin,Yoo,A,Arts,41048,8,1
24,20123480,Rosaline,Jun,A,Arts,44915,25,3
25,20123481,Jimin,Park,B,Engineering,34570,20,3
26,20123482,Joseph,Kim,A,Math,33376,12,6
28,20123484,Robbie,Tee,B,Engineering,49682,10,6
29,20123485,Shelly,Yoon,A,Math,33585,5,10

We can also drop entire columns as well. Suppose that city of students is no longer a relevant information to be kept in the system.

In [57]:
# Drop columns
df = df.drop(['City'], axis = 1)
df

,StudentID,FirstName,LastName,GradeAverage,Faculty,Tuition,OfficeHoursParticipated,ClassesSkipped,Age
0,20123456,John,Park,B,Arts,44191,0,5,NaN
1,20123457,Alex,Great,B,Science,32245,4,10,NaN
3,20123459,Michael,Bay,A,Math,46478,15,2,NaN
4,20123460,Scott,Foster,A,Engineering,36784,5,8,NaN
5,20123461,Amy,Winehouse,B,Arts,36537,10,3,NaN
7,20123463,Homer,Simpson,C,Engineering,47669,4,7,NaN
8,20123464,Marge,Simpson,B,Math,39429,10,3,NaN
9,20123465,Peter,Gryffin,D,Arts,31956,7,7,NaN
11,20123467,Megan,Botts,A,Science,34751,25,1,NaN
12,20123468,Cyrus,Wong,A,Science,49298,20,0,NaN
17,20123473,Carol,Kuo,B,Engineering,43063,7,4,NaN
18,20123474,Tim,James,B,Science,46775,9,4,NaN
19,20123475,Johnson,Curry,B,Engineering,40539,9,3,NaN
21,20123477,Josh,Hart,A,Engineering,46468,4,8,NaN
22,20123478,Justin,Kang,A,Engineering,35859,2,9,NaN
23,20123479,Kevin,Yoo,A,Arts,41048,8,1,NaN
24,20123480,Rosaline,Jun,A,Arts,44915,25,3,NaN
25,20123481,Jimin,Park,B,Engineering,34570,20,3,NaN
26,20123482,Joseph,Kim,A,Math,33376,12,6,NaN
28,20123484,Robbie,Tee,B,Engineering,49682,10,6,NaN
29,20123485,Shelly,Yoon,A,Math,33585,5,10,NaN
30,20123420,Scottie,Barnes,A,Science,50000,0,0,21.0

## Creating New Indicies

We can modify the indicies in our DataFrame so that it is more relevant to our needs, rather than the standard numbering system. One example of this would be if we were to use our StudentIDs as our index. We can use the `set_index()` function to set this as our index.

In [19]:
import pandas
import numpy
df = pandas.read_csv('Student Grades.csv')
df = df.set_index('StudentID')
df

,FirstName,LastName,GradeAverage,Faculty,Tuition,OfficeHoursParticipated,ClassesSkipped
StudentID,,,,,,,
20123456,John,Park,B,Arts,44191,0,5
20123457,Alex,Great,B,Science,32245,4,10
20123458,Sebastian,Taylor,B,Business,42679,6,7
20123459,Michael,Bay,A,Math,46478,15,2
20123460,Scott,Foster,A,Engineering,36784,5,8
20123461,Amy,Winehouse,B,Arts,36537,10,3
20123462,Ralph,Wiggins,B,Business,40762,2,8
20123463,Homer,Simpson,C,Engineering,47669,4,7
20123464,Marge,Simpson,B,Math,39429,10,3
20123465,Peter,Gryffin,D,Arts,31956,7,7
20123466,Louise,King,D,Business,33227,6,7
20123467,Megan,Botts,A,Science,34751,25,1
20123468,Cyrus,Wong,A,Science,49298,20,0
20123469,Michelle,Chang,B,Business,35046,5,4
20123470,Zachary,Chua,A,Business,31210,10,0
20123471,Angus,Helmsworth,B,Business,47515,10,1
20123472,Aaron,McDowell,B,Business,43421,13,2
20123473,Carol,Kuo,B,Engineering,43063,7,4
20123474,Tim,James,B,Science,46775,9,4
20123475,Johnson,Curry,B,Engineering,40539,9,3
20123476,Paul,Reed,A,Business,41397,14,2
20123477,Josh,Hart,A,Engineering,46468,4,8
20123478,Justin,Kang,A,Engineering,35859,2,9
20123479,Kevin,Yoo,A,Arts,41048,8,1
20123480,Rosaline,Jun,A,Arts,44915,25,3
20123481,Jimin,Park,B,Engineering,34570,20,3
20123482,Joseph,Kim,A,Math,33376,12,6
20123483,Chris,Dang,F,Business,44737,3,8
20123484,Robbie,Tee,B,Engineering,49682,10,6
20123485,Shelly,Yoon,A,Math,33585,5,10

However, if we wanted to revert back to the old index, we can simply use the `reset_index()` function to revert back.

In [21]:
df = df.reset_index()
df

,StudentID,FirstName,LastName,GradeAverage,Faculty,Tuition,OfficeHoursParticipated,ClassesSkipped
0,20123456,John,Park,B,Arts,44191,0,5
1,20123457,Alex,Great,B,Science,32245,4,10
2,20123458,Sebastian,Taylor,B,Business,42679,6,7
3,20123459,Michael,Bay,A,Math,46478,15,2
4,20123460,Scott,Foster,A,Engineering,36784,5,8
5,20123461,Amy,Winehouse,B,Arts,36537,10,3
6,20123462,Ralph,Wiggins,B,Business,40762,2,8
7,20123463,Homer,Simpson,C,Engineering,47669,4,7
8,20123464,Marge,Simpson,B,Math,39429,10,3
9,20123465,Peter,Gryffin,D,Arts,31956,7,7
10,20123466,Louise,King,D,Business,33227,6,7
11,20123467,Megan,Botts,A,Science,34751,25,1
12,20123468,Cyrus,Wong,A,Science,49298,20,0
13,20123469,Michelle,Chang,B,Business,35046,5,4
14,20123470,Zachary,Chua,A,Business,31210,10,0
15,20123471,Angus,Helmsworth,B,Business,47515,10,1
16,20123472,Aaron,McDowell,B,Business,43421,13,2
17,20123473,Carol,Kuo,B,Engineering,43063,7,4
18,20123474,Tim,James,B,Science,46775,9,4
19,20123475,Johnson,Curry,B,Engineering,40539,9,3
20,20123476,Paul,Reed,A,Business,41397,14,2
21,20123477,Josh,Hart,A,Engineering,46468,4,8
22,20123478,Justin,Kang,A,Engineering,35859,2,9
23,20123479,Kevin,Yoo,A,Arts,41048,8,1
24,20123480,Rosaline,Jun,A,Arts,44915,25,3
25,20123481,Jimin,Park,B,Engineering,34570,20,3
26,20123482,Joseph,Kim,A,Math,33376,12,6
27,20123483,Chris,Dang,F,Business,44737,3,8
28,20123484,Robbie,Tee,B,Engineering,49682,10,6
29,20123485,Shelly,Yoon,A,Math,33585,5,10

## Grouping Data

Another powerful way to derive insights from your data is the use of a `groupby()` function. This involves combining like values together to generate aggregated values associated with the combined values.

Some common functions that are used after a `groupby` functions include:

    1. mean
    2. median
    3. count
    4. sum

Consider for example we wanted to group the number of students by faculty, then count the number of students per faculty.

In [27]:
# Selecting the count of StudentIDs, grouped by each faculty
df.groupby('Faculty')['OfficeHoursParticipated'].mean()

Faculty
Arts           10.000000
Business        7.666667
Engineering     7.625000
Math           10.500000
Science        14.500000
Name: OfficeHoursParticipated, dtype: float64

If we wanted to find the average age by faculty:

In [29]:
# Selecting the mean of the ages, grouped by each faculty
df.groupby(by = ['Faculty', 'GradeAverage'])['Tuition'].mean()

Faculty      GradeAverage
Arts         A               42981.500000
             B               40364.000000
             D               31956.000000
Business     A               36303.500000
             B               41884.600000
             D               33227.000000
             F               44737.000000
Engineering  A               39703.666667
             B               41963.500000
             C               47669.000000
Math         A               37813.000000
             B               39429.000000
Science      A               42024.500000
             B               39510.000000
Name: Tuition, dtype: float64

Suppose we wanted to find the tuition spent for each faculty, broken down by grade.

In [ ]:
# Selecting the average age of each grade in each faculty

We can see that based on the example above, we can uncover insights that were not obvious to us previously, such as the engineering faculty having no students with an A average, no students have an F average, and their B and C average students pay the most out of all faculties.

## Concatenation of DataFrames

In a corporate environment, there will be many instances where multiple datasets will need to be combined. In this instance, the `concat()` function will allow us to combine DataFrames together into one.

Suppose we have separate DataFrame of student information in another server:

In [31]:
data2 = {'StudentID': [20123420,20123421], 'Age':[33,31], 'FirstName': ['Stephen','Klay'], 
         'LastName': ['Curry','Thompson'], 'GradeAverage': ['A','A'], 'Faculty': ['Science','Math'], 
         'Tuition': [31000,41000], 'OfficeHoursParticipated': [3,1], 'ClassesSkipped': [4,6], 
         'State': ['California','California']}
df2 = pandas.DataFrame(data2)
df2

,StudentID,Age,FirstName,LastName,GradeAverage,Faculty,Tuition,OfficeHoursParticipated,ClassesSkipped,State
0,20123420,33,Stephen,Curry,A,Science,31000,3,4,California
1,20123421,31,Klay,Thompson,A,Math,41000,1,6,California

In order to combine the two DataFrames together, there are two ways of concatenating:

1. Concatenating the DataFrames horizontally
2. Concatenating the DataFrames vertically

We will first go through concatenating vertically. We see that the two rows in the second DataFrame have been added below the first. However in the results below we see that the `State` column was added, because the second DataFrame had this column. Therefore, the values in the first DataFrame that did not have this information will be shown as `NaN`.

In [32]:
#concatenate two dataframes vertically, adding addtional rows
pandas.concat([df, df2])

,StudentID,FirstName,LastName,GradeAverage,Faculty,Tuition,OfficeHoursParticipated,ClassesSkipped,Age,State
0,20123456,John,Park,B,Arts,44191,0,5,NaN,NaN
1,20123457,Alex,Great,B,Science,32245,4,10,NaN,NaN
2,20123458,Sebastian,Taylor,B,Business,42679,6,7,NaN,NaN
3,20123459,Michael,Bay,A,Math,46478,15,2,NaN,NaN
4,20123460,Scott,Foster,A,Engineering,36784,5,8,NaN,NaN
5,20123461,Amy,Winehouse,B,Arts,36537,10,3,NaN,NaN
6,20123462,Ralph,Wiggins,B,Business,40762,2,8,NaN,NaN
7,20123463,Homer,Simpson,C,Engineering,47669,4,7,NaN,NaN
8,20123464,Marge,Simpson,B,Math,39429,10,3,NaN,NaN
9,20123465,Peter,Gryffin,D,Arts,31956,7,7,NaN,NaN
10,20123466,Louise,King,D,Business,33227,6,7,NaN,NaN
11,20123467,Megan,Botts,A,Science,34751,25,1,NaN,NaN
12,20123468,Cyrus,Wong,A,Science,49298,20,0,NaN,NaN
13,20123469,Michelle,Chang,B,Business,35046,5,4,NaN,NaN
14,20123470,Zachary,Chua,A,Business,31210,10,0,NaN,NaN
15,20123471,Angus,Helmsworth,B,Business,47515,10,1,NaN,NaN
16,20123472,Aaron,McDowell,B,Business,43421,13,2,NaN,NaN
17,20123473,Carol,Kuo,B,Engineering,43063,7,4,NaN,NaN
18,20123474,Tim,James,B,Science,46775,9,4,NaN,NaN
19,20123475,Johnson,Curry,B,Engineering,40539,9,3,NaN,NaN
20,20123476,Paul,Reed,A,Business,41397,14,2,NaN,NaN
21,20123477,Josh,Hart,A,Engineering,46468,4,8,NaN,NaN
22,20123478,Justin,Kang,A,Engineering,35859,2,9,NaN,NaN
23,20123479,Kevin,Yoo,A,Arts,41048,8,1,NaN,NaN
24,20123480,Rosaline,Jun,A,Arts,44915,25,3,NaN,NaN
25,20123481,Jimin,Park,B,Engineering,34570,20,3,NaN,NaN
26,20123482,Joseph,Kim,A,Math,33376,12,6,NaN,NaN
27,20123483,Chris,Dang,F,Business,44737,3,8,NaN,NaN
28,20123484,Robbie,Tee,B,Engineering,49682,10,6,NaN,NaN
29,20123485,Shelly,Yoon,A,Math,33585,5,10,NaN,NaN
0,20123420,Stephen,Curry,A,Science,31000,3,4,33.0,California
1,20123421,Klay,Thompson,A,Math,41000,1,6,31.0,California

If we were to concatenate the two DataFrames horizontally, it would not look great, as we are combining datasets that have the same columns. When combining two DataFrames, we must consider if we want to add more data in the column level or row level before deciding to concatenate horizontally or vertically.

In [33]:
# concatenate two dataframes horizontally, adding addtional columns
pandas.concat([df, df2], axis = 1)

,StudentID,FirstName,LastName,GradeAverage,Faculty,Tuition,OfficeHoursParticipated,ClassesSkipped,StudentID,Age,FirstName,LastName,GradeAverage,Faculty,Tuition,OfficeHoursParticipated,ClassesSkipped,State
0,20123456,John,Park,B,Arts,44191,0,5,20123420.0,33.0,Stephen,Curry,A,Science,31000.0,3.0,4.0,California
1,20123457,Alex,Great,B,Science,32245,4,10,20123421.0,31.0,Klay,Thompson,A,Math,41000.0,1.0,6.0,California
2,20123458,Sebastian,Taylor,B,Business,42679,6,7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,20123459,Michael,Bay,A,Math,46478,15,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,20123460,Scott,Foster,A,Engineering,36784,5,8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,20123461,Amy,Winehouse,B,Arts,36537,10,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,20123462,Ralph,Wiggins,B,Business,40762,2,8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,20123463,Homer,Simpson,C,Engineering,47669,4,7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,20123464,Marge,Simpson,B,Math,39429,10,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,20123465,Peter,Gryffin,D,Arts,31956,7,7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
10,20123466,Louise,King,D,Business,33227,6,7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11,20123467,Megan,Botts,A,Science,34751,25,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
12,20123468,Cyrus,Wong,A,Science,49298,20,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
13,20123469,Michelle,Chang,B,Business,35046,5,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
14,20123470,Zachary,Chua,A,Business,31210,10,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
15,20123471,Angus,Helmsworth,B,Business,47515,10,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
16,20123472,Aaron,McDowell,B,Business,43421,13,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17,20123473,Carol,Kuo,B,Engineering,43063,7,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
18,20123474,Tim,James,B,Science,46775,9,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19,20123475,Johnson,Curry,B,Engineering,40539,9,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
20,20123476,Paul,Reed,A,Business,41397,14,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
21,20123477,Josh,Hart,A,Engineering,46468,4,8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
22,20123478,Justin,Kang,A,Engineering,35859,2,9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
23,20123479,Kevin,Yoo,A,Arts,41048,8,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
24,20123480,Rosaline,Jun,A,Arts,44915,25,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25,20123481,Jimin,Park,B,Engineering,34570,20,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
26,20123482,Joseph,Kim,A,Math,33376,12,6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
27,20123483,Chris,Dang,F,Business,44737,3,8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
28,20123484,Robbie,Tee,B,Engineering,49682,10,6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
29,20123485,Shelly,Yoon,A,Math,33585,5,10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN